//矩形
for(var j=1;j<=9;j++){
	for(var str='',i=1;i<=9;i++){//1行9列*
	str+='*';
	}console.log(str);
}
//正三角
for(var j=1;j<=9;j++){//行
	for(var str='',i=1;i<=j;i++){//列，第一行1列，第二行2列..第九行9九>>>>i<=j
		str+='*';
	}
	console.log(str);
}
//倒三角
for(var j=1;j<=9;j++){//行
	for(var str='',i=1;i<=10-j;i++){//列第一行9列，第二行8列..第九行1列>>>>i<=10-j
		str+='*';
	}
	console.log(str);
}
//平行四边形
for(var j=1;j<=9;j++){//行
	
		for(var str='',i=1;i<=j+8;i++){//第一行j9列i(第0列开始打印)，
			if(i>=j){                   //第二行10列(第一列打印空),第三行11列(前两列打印空),
				str+='*';			     //..第九行17列(前8列打印空)>>>i-j<=8即i<=j+8
		} else{                         //如果i<j打印空字符，j>=i,打印*.
				str+='  ';
		}                         
	}
	console.log(str);
}
//菱形
//第一行5列，第1、2、4、5列打印空，第3列打印*>>>>>
//第二行5列，第1、5行打印空,第2、3、4列打印*
//第三行5列，第1、2、3、4、5列都打印*
//第四行5列，第1、5列打印空,第2、3、4列打印*
//第五行5列，第1、2、4、5列打印空，第3列打印*
//5行5列

for(var j=1;j<=5;j++){//行
	for(var str='',i=1;i<=5;i++){
		str+=' ';
		if(j==1&&i==3){
			str+='*'
		}else if(j==2&&i!=1||i!=5){
			str+='*'
		}else if(j==3){
			str+='*';
		}else if(j==4&&i!=1||i!=5){
			str+='*';
		}else if(j==5&&i==3){
			str+='*';
		}
		
	}
	console.log(str);

}

